app/controllers/posts_controller.rb

SELECT * FROM `posts`
---
  def index
    @posts = Post.non_petitions().search(params[:search], params[:page])

INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES('De-Criminalize Marijuana', 'Last year the US arrested over 800,000 people for cannabis related charges. Over 80% of those arrests were for simple possession alone.', '2009-06-03 22:12:46', '2009-06-03 22:12:46')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save