app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save do |result|
---
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `openid_identifier`, `password_salt`, `persistence_token`, `email`) VALUES('2009-06-04 21:14:56', '457c1ef2d3a7f3bce2177f89a4ce47eb201f51814c9109448af36f457d7127a9f5c9c5c290a6b3011ff2449cf213de70fc42ef4b189fad7cd76a87cf9294f63c', '2009-06-04 21:14:56', 'kylep', NULL, '9Q225TVtMt1lpjtYEKjg', '7e3a9c64b25c9262ade8a4462b02d62bb294993511e9ad93c5d4a2e9b04da17fc28f58d4c1f421f299f66a17175721fe66182ae4b69606cb2559f5ded5b72aa9', 'kyle@kylepowers.com')

  def update
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1